ders1/cypress/e2e/cypress/performance/post.yml
config:
  target: "https://httpbin.org"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Goit Performance Testi" # opsiyonel
  plugins:
    ensure:
      thresholds: 
        - http.response_time.max: 1500
        - http.response_time.2xx.p95: 2500
      conditions:
        - expression: http.responses == 1
        - expression: vusers.completed == 1   
        - expression: http.response_time.max <1000 and http.response_time.2xx.p95 < 500

scenarios:
  - name: "Create Account"
    flow:
      - post:
          url: "{{ target }}/post"
          json:
            username: "goit"
            password: "12345"
          headers:
            Content-type: "application/json"  
          capture:
            - json: "$.json"
              as: "response_body"
            - json: "$.headers.Host"  
              as: "host"
      - log: "Response Body: {{response_body}}" 
      - log: "Host: {{host}}"